src/main/resources/webServiceRequestXmls/VirtualCardIssuance.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:elt="http://eltws.map.ecs.com/">
    <soapenv:Header/>
   <soapenv:Body>
      <elt:callExtAPISVCAndLVCIssuence>
         <extAPISVCAndLVCIssuenceReq>
            <walletAmountField1></walletAmountField1>
    <walletAmountField2></walletAmountField2>
            <walletAmountField3></walletAmountField3>
            <walletAmountField4></walletAmountField4>
            <walletAmountField5></walletAmountField5>
            <walletDateField3></walletDateField3>
            <walletDateField4></walletDateField4>
            <walletDateField5></walletDateField5>
            <legalId2></legalId2>
            <clientAmountField1></clientAmountField1>
            <clientAmountField2></clientAmountField2>
            <clientAmountField3></clientAmountField3>
            <clientAmountField4></clientAmountField4>
            <clientAmountField5></clientAmountField5>
            <walletDataField1></walletDataField1>
            <walletDataField2></walletDataField2>
            <walletDataField3></walletDataField3>
            <walletDataField4></walletDataField4>
            <walletDataField5></walletDataField5>
            <walletDateField1></walletDateField1>
            <walletDateField2></walletDateField2>
            <officeContactNo1></officeContactNo1>
            <officeContactNo2></officeContactNo2>
            <officeMobileISDN></officeMobileISDN>
            <officeMobNo>7897897980</officeMobNo>
            <officeEmailID>a.b@gmail.com</officeEmailID>
            <employeeID></employeeID>
            <designation></designation>
            <department></department>
            <jobTenureYear></jobTenureYear>
            <joiningDate></joiningDate>
            <employerName></employerName>
            <occupationType></occupationType>
            <employerType></employerType>
            <employmentStatus></employmentStatus>
            <registeredMobileISDN>+91</registeredMobileISDN>
            <registeredMobileNumber>7898997897</registeredMobileNumber>
            <registeredeMailId>a.b@gmail.com</registeredeMailId>
            <statementCopyMode></statementCopyMode>
            <kycStatus></kycStatus>
            <legalIdType1></legalIdType1>
            <legalId1></legalId1>
            <legalID1PlaceOfIssuance></legalID1PlaceOfIssuance>
            <legalID1ExpiryDate></legalID1ExpiryDate>
            <legalIdType2></legalIdType2>
            <legalID2PlaceOfIssuance></legalID2PlaceOfIssuance>
            <legalID2ExpiryDate></legalID2ExpiryDate>
            <legalIdType3></legalIdType3>
            <legalId3></legalId3>
            <legalID3PlaceOfIssuance></legalID3PlaceOfIssuance>
            <legalID3ExpiryDate></legalID3ExpiryDate>
            <legalIdType4></legalIdType4>
            <legalId4></legalId4>
            <legalID4PlaceOfIssuance></legalID4PlaceOfIssuance>
   <legalID4ExpiryDate></legalID4ExpiryDate>
            <loadAmount>20</loadAmount>
            <loadCurrency>356</loadCurrency>
            <perTransactionLimit></perTransactionLimit>
            <velocity></velocity>
            <totalTransactionLimit></totalTransactionLimit>
            <clientDataField1></clientDataField1>
            <clientDataField2></clientDataField2>
            <clientDataField3></clientDataField3>
            <clientDataField5></clientDataField5>
            <clientDataField4></clientDataField4>
            <clientDateField1></clientDateField1>
            <clientDateField2></clientDateField2>
            <clientDateField3></clientDateField3>
            <clientDateField4></clientDateField4>
            <clientDateField5></clientDateField5>
            <currentZipCode>411006</currentZipCode>
            <currentContactNo1>787897890</currentContactNo1>
            <currentContactNo2></currentContactNo2>
            <userId>TAdmin</userId>
            <sessionKey>31GSJHYFXF0FL00WKN4FQNL</sessionKey>
            <channel>31</channel>
            <transactionCounter>110000000333</transactionCounter>
            <passCodeFlag>N</passCodeFlag>
            <passCode></passCode>
            <transactionCode>306</transactionCode>
            <applicationType>1</applicationType>
            <deviceType>7</deviceType>
            <programCode>SVC</programCode>
            <primaryDeviceNumber></primaryDeviceNumber>
            <cbsClientCode></cbsClientCode>
            <customerType>0</customerType>
            <corporateClientCode></corporateClientCode>
            <title>1</title>
            <firstName>Amit</firstName>
            <middleName2></middleName2>
            
               <middleName1></middleName1>
            <lastName>Chintal</lastName>
            <maritalStatus>0</maritalStatus>
            <maidenName>R</maidenName>
            <gender>M</gender>
            <birthDate>19890524</birthDate>
            <birthCity></birthCity>
            <birthCountry>356</birthCountry>
            <nationalityCode>356</nationalityCode>
            <languagePreference>en</languagePreference>
            <education>3</education>
            <preferredMailingAddress>C</preferredMailingAddress>
            <currentAddress1>yerwada</currentAddress1>
            <currentAddress2>pune</currentAddress2>
           <currentAddress3></currentAddress3>
            <currentAddress4></currentAddress4>
            <currentCity>PUN</currentCity>
            <currentState>MAH</currentState>
            <currentCountry>356</currentCountry>
               <permanentAddress1>yerwada</permanentAddress1>
            <permanentAddress2>pune</permanentAddress2>
            <permanentAddress3></permanentAddress3>
            <permanentAddress4></permanentAddress4>
            <permanentCity>PUN</permanentCity>
            <permanentState>MAH</permanentState>
            <permanentCountry>356</permanentCountry>
            <permanantContactNo1>789789789789</permanantContactNo1>
            <permanantContactNo2>78978978900</permanantContactNo2>
            <permanentZipCode>411006</permanentZipCode>
            <officeAddress1>yerwada</officeAddress1>
            <officeAddress2>buss bay</officeAddress2>
            <officeAddress3>pune</officeAddress3>
            <officeAddress4>pune</officeAddress4>
            <officeCity>PUN</officeCity>
            <officeState>MAH</officeState>
            <officeCountry>356</officeCountry>
            <officeZipCode>4110006</officeZipCode>
            <officeExt>7897890</officeExt>
            <kycRemark></kycRemark>
            <deviceDataField1></deviceDataField1>
            <deviceDataField2></deviceDataField2>
            <deviceDataField3></deviceDataField3>
            <deviceDataField4></deviceDataField4>
            <deviceDataField5></deviceDataField5>
           <deviceDateField1></deviceDateField1>
            <deviceDateField2></deviceDateField2>
            <deviceDateField3></deviceDateField3>
            <deviceDateField4></deviceDateField4>
            <deviceDateField5></deviceDateField5>
            <deviceAmountField1></deviceAmountField1>
            <deviceAmountField2></deviceAmountField2>
            <deviceAmountField3></deviceAmountField3>
            <deviceAmountField4></deviceAmountField4>
            <deviceAmountField5></deviceAmountField5>
            <expiryDate></expiryDate>
               <walletNumber></walletNumber>
            <branchCode>003</branchCode>
            <accountType></accountType>
            <priorityPassIndicator>N</priorityPassIndicator>
         </extAPISVCAndLVCIssuenceReq>
      </elt:callExtAPISVCAndLVCIssuence>
   </soapenv:Body>
      
</soapenv:Envelope>